chap5/chap5.org
* 基底

** 座標系
*** 座標表現

ベクトル空間Νの座標系は、Νの生成子A1, ... ANで指定される。

$v=\alpha _1 a _1 + ...  + \alpha _n a _n$

これらの係数は座標と呼ばれる。

*** 座標表現及び行列とベクトルの積
- 「uはvのa1 ... anについての座標表現である」という事実は、行列とベクトルの方程式Au=vとして書き表すことができる。
- したがって、座標表現uを元のベクトルvに戻すには、uにAをかければよい
- ベクトルvを元の座標表現に戻すには、Ax=vを解けば良い。

** 初めての非可逆圧縮
最も近いスパースベクトルに置き換える。→画像の劣化が激しい

画像ベクトルを座標で表現する。→データ量が減ってない


- ステップ1 ベクトルa1....anを選ぶ
- ステップ2 圧縮したい画像に対応するベクトルvに対し、そのa1....anについての座標表現uを求める。
- ステップ3 uを最も近いkスパースベクトルu~で置き換え格納する。
- ステップ4 u~から画像を復元するために、対応するベクトルa1...anの線型結合を計算する


** 生成子を探す２つの欲張りアルゴリズム

*ベクトル空間νが与えられた時、その線形包がνと等しくなるベクトルの最小数はいくつか？*

- グローアルゴリズム
- シュリンクアルゴリズム

- 線形独立
- 線形従属


** 基底
νをベクトル空間とする。νの基底とはνを生成する線形独立なベクトルの集合である。

*** 交換の補題
線形包を変えることなく、ベクトルzを加えて別のベクトルを取り除ける。
