conding_the_matrix/chap5/chap5.md
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. 基底</a>
<ul>
<li><a href="#sec-1-1">1.1. 座標系</a>
<ul>
<li><a href="#sec-1-1-1">1.1.1. 座標表現</a></li>
<li><a href="#sec-1-1-2">1.1.2. 座標表現及び行列とベクトルの積</a></li>
</ul>
</li>
<li><a href="#sec-1-2">1.2. 初めての非可逆圧縮</a></li>
<li><a href="#sec-1-3">1.3. 生成子を探す２つの欲張りアルゴリズム</a></li>
<li><a href="#sec-1-4">1.4. 基底</a>
<ul>
<li><a href="#sec-1-4-1">1.4.1. 交換の補題</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

# 基底<a id="sec-1" name="sec-1"></a>

## 座標系<a id="sec-1-1" name="sec-1-1"></a>

### 座標表現<a id="sec-1-1-1" name="sec-1-1-1"></a>

ベクトル空間Νの座標系は、Νの生成子A1, &#x2026; ANで指定される。

\(v=\alpha _1 a _1 + ...  + \alpha _n a _n\)

これらの係数は座標と呼ばれる。

### 座標表現及び行列とベクトルの積<a id="sec-1-1-2" name="sec-1-1-2"></a>

-   「uはvのa1 &#x2026; anについての座標表現である」という事実は、行列とベクトルの方程式Au=vとして書き表すことができる。
-   したがって、座標表現uを元のベクトルvに戻すには、uにAをかければよい
-   ベクトルvを元の座標表現に戻すには、Ax=vを解けば良い。

## 初めての非可逆圧縮<a id="sec-1-2" name="sec-1-2"></a>

最も近いスパースベクトルに置き換える。→画像の劣化が激しい

画像ベクトルを座標で表現する。→データ量が減ってない


-   ステップ1 ベクトルa1&#x2026;.anを選ぶ
-   ステップ2 圧縮したい画像に対応するベクトルvに対し、そのa1&#x2026;.anについての座標表現uを求める。
-   ステップ3 uを最も近いkスパースベクトルu~で置き換え格納する。
-   ステップ4 u~から画像を復元するために、対応するベクトルa1&#x2026;anの線型結合を計算する

## 生成子を探す２つの欲張りアルゴリズム<a id="sec-1-3" name="sec-1-3"></a>

**ベクトル空間νが与えられた時、その線形包がνと等しくなるベクトルの最小数はいくつか？**

-   グローアルゴリズム
-   シュリンクアルゴリズム

-   線形独立
-   線形従属

## 基底<a id="sec-1-4" name="sec-1-4"></a>

νをベクトル空間とする。νの基底とはνを生成する線形独立なベクトルの集合である。

### 交換の補題<a id="sec-1-4-1" name="sec-1-4-1"></a>

線形包を変えることなく、ベクトルzを加えて別のベクトルを取り除ける。
